In [2]:
import pandas as pd
import numpy as np
import random

# pandas 数据处理

## 1.删除重复元素

In [3]:
def make_df(index,columns):
    df = pd.DataFrame({col:[col + str(i) for i in index] for col in columns})
    df.index = index
    return df

In [4]:
df = make_df([1,2,3,4],list('ABCD'))
df

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

使用duplicated（）函数检测重读的行，返回元素为布尔类型的Series对象，每个元素对应一行，如果该行不是第一次出现，则元素为True

In [5]:
df.duplicated()

1    False
2    False
3    False
4    False
dtype: bool

使用drop_duplicates()函数删除重复的行

In [6]:
df.loc[1] = df.loc[2]
df

    A   B   C   D
1  A2  B2  C2  D2
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [7]:
df.duplicated()

1    False
2     True
3    False
4    False
dtype: bool

In [8]:
df.drop_duplicates()

    A   B   C   D
1  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [9]:
df[~df.duplicated()]

    A   B   C   D
1  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [10]:
#逻辑运算
df[np.logical_not(df.duplicated())]

    A   B   C   D
1  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [11]:
df.duplicated(keep='first')#last

1    False
2     True
3    False
4    False
dtype: bool

## 2.映射
- replace（）函数：替换
- 最重要：map（）函数：新建一列
- rename（）函数：替换索引

## 1）replace（）函数：替换元素
使用replace（）函数，对values进行替换操作

首先定义一个字典

使用.replace（）

replace还经常用来替换NaN元素

=====================================

In [12]:
data = np.random.randint(0,150,size=(4,3))
index = ['张三','李四','王五','赵六']
columns = ['语文','数学','英语']
df = pd.DataFrame(index=index,data= data,columns=columns)
df

     语文   数学   英语
张三  123  110   25
李四   19  109  107
王五  115  142   22
赵六  107   44  114

In [13]:
#首先定义一个字典
mapping = {31:104,37:107,15:117,43:134}

In [14]:
#调用replace
df.replace(mapping)

     语文   数学   英语
张三  123  110   25
李四   19  109  107
王五  115  142   22
赵六  107   44  114

replace还经常用来替换NaN元素

In [15]:
df.iloc[0,0]=np.nan
df

       语文   数学   英语
张三    NaN  110   25
李四   19.0  109  107
王五  115.0  142   22
赵六  107.0   44  114

In [16]:
df.replace({np.nan:0})

       语文   数学   英语
张三    0.0  110   25
李四   19.0  109  107
王五  115.0  142   22
赵六  107.0   44  114

=====================================

把张三李四成绩中所用满分的情况都记为0分

=====================================

In [17]:
df.iloc[0,0]=150
df.iloc[1,0]=150
df

       语文   数学   英语
张三  150.0  110   25
李四  150.0  109  107
王五  115.0  142   22
赵六  107.0   44  114

In [18]:
df.replace({150:0})

       语文   数学   英语
张三    0.0  110   25
李四    0.0  109  107
王五  115.0  142   22
赵六  107.0   44  114

## 2)map()函数：新建一列
①使用map（）函数，由已有的列生成一个新列

②适合处理某一单独的列

③任然是新建一个字典

④map（）函数中科院使用lambda函数

⑤transform（）和map（）类似

⑥使用map（）函数新建一个新列

In [19]:
df

       语文   数学   英语
张三  150.0  110   25
李四  150.0  109  107
王五  115.0  142   22
赵六  107.0   44  114

In [20]:
#根据已有列数据生成新的一列数据
df['理综'] = df['数学'].map({56:123,83:110,113:130,15:50})
df

       语文   数学   英语  理综
张三  150.0  110   25 NaN
李四  150.0  109  107 NaN
王五  115.0  142   22 NaN
赵六  107.0   44  114 NaN

In [21]:
# 用法二：修改已有列的数据
df['数学'] = df['数学'].map({56:10,83:113,113:14,15:13})
df

       语文  数学   英语  理综
张三  150.0 NaN   25 NaN
李四  150.0 NaN  107 NaN
王五  115.0 NaN   22 NaN
赵六  107.0 NaN  114 NaN

In [22]:
#用法三：map()函数中使用lambda函数
df['及格与否'] = df['英语'].map(lambda item:item >=60)
df

       语文  数学   英语  理综   及格与否
张三  150.0 NaN   25 NaN  False
李四  150.0 NaN  107 NaN   True
王五  115.0 NaN   22 NaN  False
赵六  107.0 NaN  114 NaN   True

In [23]:
df['python']=df['英语'].map(lambda item:item*2)
df

       语文  数学   英语  理综   及格与否  python
张三  150.0 NaN   25 NaN  False      50
李四  150.0 NaN  107 NaN   True     214
王五  115.0 NaN   22 NaN  False      44
赵六  107.0 NaN  114 NaN   True     228

## 3）rename函数：替换索引

In [24]:
df

       语文  数学   英语  理综   及格与否  python
张三  150.0 NaN   25 NaN  False      50
李四  150.0 NaN  107 NaN   True     214
王五  115.0 NaN   22 NaN  False      44
赵六  107.0 NaN  114 NaN   True     228

In [25]:
#先创建一个字典
mapping = {'语文':'Chinese'}
df.rename(mapping,axis=1)

    Chinese  数学   英语  理综   及格与否  python
张三    150.0 NaN   25 NaN  False      50
李四    150.0 NaN  107 NaN   True     214
王五    115.0 NaN   22 NaN  False      44
赵六    107.0 NaN  114 NaN   True     228

In [26]:
df.rename({'张三':'zhang san'},axis=0)

              语文  数学   英语  理综   及格与否  python
zhang san  150.0 NaN   25 NaN  False      50
李四         150.0 NaN  107 NaN   True     214
王五         115.0 NaN   22 NaN  False      44
赵六         107.0 NaN  114 NaN   True     228

# 3.异常值检测和过滤

使用describe（）函数查看每一列的描述性统计量

In [27]:
df.describe()

               语文   数学          英语   理综      python
count    4.000000  0.0    4.000000  0.0    4.000000
mean   130.500000  NaN   67.000000  NaN  134.000000
std     22.752289  NaN   50.325606  NaN  100.651213
min    107.000000  NaN   22.000000  NaN   44.000000
25%    113.000000  NaN   24.250000  NaN   48.500000
50%    132.500000  NaN   66.000000  NaN  132.000000
75%    150.000000  NaN  108.750000  NaN  217.500000
max    150.000000  NaN  114.000000  NaN  228.000000

使用std（）函数求得DataFrame对象每一列的标准差

In [28]:
df.std()

语文         22.752289
数学               NaN
英语         50.325606
理综               NaN
及格与否        0.577350
python    100.651213
dtype: float64

根据每一列的标准差，对DataFrame元素进行过滤

异常值的检测一定要有一个标准，具体的标准要根据具体业务来分析，

In [29]:
df =pd.DataFrame(data=np.random.randn(10000,3))
df.head()

          0         1         2
0  0.603753  1.414938  1.512504
1  1.187443  1.235556  0.127585
2  0.327148 -0.831757 -0.467482
3 -0.386547 -0.029445  0.047594
4  0.662575 -1.762255  1.203973

In [36]:
df[(df.abs() > 3*df.std()).any(axis=1)]

             0         1         2
45   -1.208350  0.583350 -3.196420
83    0.001004  3.411464 -0.582648
100  -1.789011 -1.151435 -3.278812
287   0.340455  0.120469 -3.352591
303   0.205401  0.269884 -3.674221
...        ...       ...       ...
9775  3.102470 -1.146718  0.186149
9779 -1.404251  3.031024 -0.525126
9867  3.438338 -0.149238  0.192268
9899 -1.047642  0.683406  4.064788
9956  0.574783 -3.130706  0.123272

[83 rows x 3 columns]

first    现制定异常值检测的标准，<绝对值大于三倍的标准偏差>

second   把标准写成一个条件      <df.abs()>3*df.std()>

third    再看是过滤行还是列      <(df.abs()>3*df.std()).any(axis=1)>

forth    最后再通过中括号中写条件写法把异常值过滤掉（filter）

# 4.抽样

In [38]:
df

             0         1         2
0     0.603753  1.414938  1.512504
1     1.187443  1.235556  0.127585
2     0.327148 -0.831757 -0.467482
3    -0.386547 -0.029445  0.047594
4     0.662575 -1.762255  1.203973
...        ...       ...       ...
9995  0.350905 -0.539344 -0.837464
9996 -0.111131  0.154277  0.262047
9997 -0.528104 -1.440200 -1.537253
9998 -0.483441 -0.964782  0.918713
9999  0.419125 -0.547528  1.659473

[10000 rows x 3 columns]

In [40]:
df.take([1,3,5],axis=0)

          0         1         2
1  1.187443  1.235556  0.127585
3 -0.386547 -0.029445  0.047594
5 -0.408118 -0.458888 -0.872340

## 随机抽样

In [41]:
#无放回抽样
np.random.permutation([1,2,3])

array([1, 2, 3])

In [43]:
df.take(np.random.permutation([1,5,3]))

          0         1         2
1  1.187443  1.235556  0.127585
3 -0.386547 -0.029445  0.047594
5 -0.408118 -0.458888 -0.872340

In [45]:
#有放回的抽样
#np.random.randint 和 df.take 结合
df.take(np.random.randint(0,4,size=5))

          0         1         2
1  1.187443  1.235556  0.127585
2  0.327148 -0.831757 -0.467482
0  0.603753  1.414938  1.512504
2  0.327148 -0.831757 -0.467482
0  0.603753  1.414938  1.512504

# 5.数据聚合【重点】

数据聚合是数据处理的最后一步，通常是要使每一个数组生成一个单一的数值

数据分类处理：
- 分组：先把数据分为几组
- 用函数处理：为不同组的数据应用不同的函数以转换数据
- 合并：把不同组得到的结果合并起来

数据分类处理的核心：groupby（）函数

如果想要使用color列索引，计算price均价，可以鲜活的price列，然后在调用groupby函数，用参数指定color这一列

In [46]:
df = pd.DataFrame({'color':['red','white','red','cyan','cyan','green','white','cyan'],
                  'price':np.random.randint(0,8,size=8),
                  'weight':np.random.randint(50,55,size=8)})
df

   color  price  weight
0    red      7      54
1  white      5      53
2    red      1      51
3   cyan      2      50
4   cyan      0      54
5  green      1      53
6  white      7      54
7   cyan      1      54

In [51]:
df.groupby(by='color').groups

{'cyan': [3, 4, 7], 'green': [5], 'red': [0, 2], 'white': [1, 6]}

In [53]:
#分组后的聚合
df.groupby(by='color').mean()

       price     weight
color
cyan     1.0  52.666667
green    1.0  53.000000
red      4.0  52.500000
white    6.0  53.500000

In [58]:
price_mean = df.groupby(by='color')[['price']].mean()

In [60]:
df.merge(price_mean,left_on='color',right_index=True,suffixes=['','_sum'])

   color  price  weight  price_sum
0    red      7      54          4
2    red      1      51          4
1  white      5      53          6
6  white      7      54          6
3   cyan      2      50          1
4   cyan      0      54          1
7   cyan      1      54          1
5  green      1      53          1

In [61]:
# 6.高级数据聚合